# AddInCommandBinding Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AddInCommandBinding Members
AddInCommandBinding Class Methods Properties Events See Also
---
The AddInCommandBinding type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RevitCommandId | The Revit command Id. |

# Events
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BeforeExecuted | Occurs before the command associated with this AddInCommandBinding executes. |
| CanExecute | Occurs when the command associated with this AddInCommandBinding initiates a check to determine whether the command can be executed on the command target. |
| Executed | Occurs when the command associated with this AddInCommandBinding executes. |

# See Also
AddInCommandBinding Class
Autodesk.Revit.UI Namespace